#M1_L5

a = "string"
b = 'string'
c = """string"""
d = '''string'''
print(a == b == c == d)
print(a is b is c is d)

#Срез (slice)
a = "проприетарный"[3]

print('сколопендра'[1:4])
print("Современное телевидение было переведено на цифровое вещание."[:23])

text = "2023-02-15 14:21:46.353 ERROR message: Ай, случилася беда!"
print(text[39:])

print("просто строка"[-6:])
print("А это не просто строка"[6:-7])
print("1234567890"[::2])

print("-------------->")

# Задание 16.5.1

str_1 = 'abcdefghijk 1456 ahalai-mahalai! Восстань, сын трёхголового дракона!'
str_1 = '012345'
print(len(str_1))
print(str_1[7:43:3])

if 9 <= (len(str_1)) >= 42:
    print(str_1[7:43:3])
else:
    print("length error: длина строки !< 8 и !>42")

print("-------------->")

text = "2023-02-15 14:21:46.353 ERROR message: Ай, случилася беда!"
template = 'message: '
index = text.index(template)
print(index)
print(len(template))

if index != -1:
    print(text[index + len(template):])

###
text = "5423534 lajksdfij;jhh абракадабра dfasdfs9d6f7686"
template = 'message: '
index = text.find(template)
print (index)

if index != -1:
    print(text[index + len(template):])

###
print("-------------->\n")
text = "12435514234 ERROR index: big_terrible_mistake message: Ай, случилася беда!"
template = 'message: '
if template in text:
    index = text.index(template)
    print(text[index + len(template):])

###
print("-------------->\n")

"абракадабра".count("а")

name = "internal_attr_2"
if not name.startswith("_"):
    print(name)


testSTR = 'asdadsq2e4321ASDAasdads3523'
print(testSTR.isupper())

### !!!! В консоле возвращает False
print("-------------->\n")
print("Незнайка".istitle())
print("Незнайка".istitle())

#Задание 16.5.2 !!!! всегда is ascii
print("--------------> Задание 16.5.2\n")
testSTR_1 = 'asdasdQWESASD'
testSTR_1 = "月asdaывфывф馬!@#!@???```ывфȵĭĕt⁴ывsdQWESȵĭĕn¹ASD"
#testSTR_1 = ''

if len(testSTR_1) != 0:
    if testSTR_1.isascii:
        print("TRUE srt is ascii")
    else:
        print("FALSE str is NOT ascii")
else:
    print("length is null")

#Задание 16.5.3
print("--------------> Задание 16.5.3\n")

testSTR2 = 'asdasdasdasd'
testSTR2 = 'asdasdasdasd_'
testSTR2 = ''
if len(testSTR2) ==0:
    print("len=0")
else:
    print(testSTR2.endswith('_'))

print(testSTR2.endswith('_'))

#Задание 16.5.4
print("\n--------------> Задание 16.5.4\n")

testSTR3 = "Типафывфыв Типа фывфывфыв Типа фвфывпрапр ТипаТипа фывфыв Типа Типа Типа фывфывапрапрап рсячсяч Типа"
print(testSTR3.count('Типа'))

print("\n-------------->\n")
testSTR4 = "А роза упала на лапу Азора"
print(testSTR4.split('а'))

testSTR5 = "авбвааббв Три слона на перепутье бббаааввв"
print("\n-------------->\n")
print(testSTR5.strip('абв'))

print(testSTR4.lower().split("а"))

"""
Кстати, раз уж выше мы упоминали фразу-палиндром, давайте соберём наши знания вместе и проверим, что это действительно палиндром. 
Для этого удалим из фразы лишние символы, подготовим её для сравнения и сравним с её же перевёрнутой задом наперёд версией. 
Это тоже одна из частых задачек на собеседованиях:
"""

testSTR6 = "А роза упала на лапу Азора"

testSTR6 = testSTR6.replace(' ','').lower()
print(testSTR6 == testSTR6[::-1])

text = "Hello World"
result = text.casefold()
print(result)

#Задание 16.5.5
print("\n--------------> Задание 16.5.5\n")

testSTR7 = 'Три утёнка по три раза тёрли лапки потрёпанными мочалками и крякали друг другу: „смотри, мои лапки чище твоих!“ Смотри, утёнок, насквозь не протри!'

print(testSTR7.casefold().count(("ТР").casefold()))

#Задание 16.5.6
#removesuffix только в версиии 3.9
print("\n--------------> Задание 16.5.6\n")
testSTR8 = "--+-- Запись номер 1 --+--"
pattern = "--+--"
#print(testSTR8.removesuffix(pattern))

#Задание 16.5.7
print("\n--------------> Задание 16.5.7\n")

#testSTR9 = "Да чтоб тебя таращило!», «Где мои деньги???», «Тестовый текст 3(!)»."
#testSTR9 = "Да чтоб тебя таращило!"
#testSTR9 = "Где мои деньги???"
#testSTR9 = "Тестовый текст 3(!)"
testSTR9 = "asdasdasdadsad! !!#!"

print(testSTR9.rstrip("!().?"))
print(testSTR9.rstrip('!().?'))

print("\n--------------> Задание 16.5.7\n")
name, author = "Незнайка", "Николай Носов"
print("{:.<30} | {:.>30}".format(name, author))

#Задание 16.5.8
print("\n--------------> Задание 16.5.8\n")

"""
V = π × r² × h,
где:
V — объем цилиндра;
r — радиус основания;
h — высота цилиндра;
π ≈ 3,1416.
"""
import math
R = 15
R = R/100
H = 10

V = math.pi * R**2 * H
print("Объем цилиндра в кубических метрах равен: ""{:.2f}".format(V))

print("\n|>--------------\n")

spade_cards = "🂡 🂢 🂣 🂤 🂥 🂦 🂧 🂨 🂩 🂪 🂫 🂬 🂭 🂮"
print(spade_cards)

#Задание 16.5.10
print("\n--------------> Задание 16.5.10\n")
print(len(str(20**50)))

#Задание 16.5.12
print("apple" < "banana")

#Задание 16.5.15
print("\n--------------> Задание 16.5.15\n")

testSTR10 = "фывфыв ыфвфыв фыв фывфвы фыв"
print(len(testSTR10.split()))