"""
        #print(f"Месяц: {month}")
        #print(f"Остаток долга: {credit_amount}")
        #print(f"Платеж: {monthly_payment}")
        #print(f"Процентная часть: {interest_percentage}")
        #print(f"Долговая часть: {debt_portion}")
        #if credit_amount < monthly_payment:
        #    print(f"Остаток долга на конец периода: 0")    
        #else:
        #    print(f"Остаток долга на конец периода: {debt_balance}")
        #    
        #print('--------------------')
"""



    - процентная часть,
    - ,
    - остаток долга на конец периода;

'Месяц','Дата платежа','Остаток долга','Ежемесячный платеж','Процентная часть','Долговая часть','Остаток долга на конец периода'