#Задание 17.3.3 (External resource)

number = 0

if number > 0 and number %2 == 0:
    print("число положительное, четное")
elif number < 0 and number % 2 == 0:
    print("число отрицательное, четное")
elif number > 0 and number %2 != 0:
    print("число положительное, нечетное")
elif number < 0 and number % 2 != 0:
    print("число отрицательное, нечетное")
else:
    print("число равно нулю")



"""
print("число положительное, четное")
print("число отрицательное, четное")
print("число положительное, нечетное")
print("число отрицательное, нечетное")
print("число равно нулю")

"""